# Answering Business Questions Using SQL

---

## 1. Introduction

In this project, we'll be working with a modified version of a database SQLite database file called [Chinook](https://github.com/lerocha/chinook-database). The Chinook database contains information about the artists, songs, and albums from a fictional digital music shop, as well as information on the shop's employees, customers, and the customers purchases. 

The objective of this project is to **recommend strategies to further improve sales performance**.

---

## 2. Open and Explore the Data

We will commence by connecting the Jupyter Notebook to the database file.

In [1]:
%%capture
%load_ext sql
%sql sqlite:///chinook.db

Now we can query the database to get a list of all tables and views in our database.

In [2]:
%%sql
SELECT
    name,
    type
FROM sqlite_master
WHERE type IN ("table", "view");

 * sqlite:///chinook.db
Done.

[('album', 'table'),
 ('artist', 'table'),
 ('customer', 'table'),
 ('employee', 'table'),
 ('genre', 'table'),
 ('invoice', 'table'),
 ('invoice_line', 'table'),
 ('media_type', 'table'),
 ('playlist', 'table'),
 ('playlist_track', 'table'),
 ('track', 'table')]

The information is contained in eleven tables, according to the schema diagram for the Chinook database below:

![Image](chinook-schema.svg)

--- 

## 3. Analyze the Data

**a. Sales by Genre**

The Chinook record store has just signed a deal with a new record label. The record label specializes in artists from the USA, and they have given Chinook some money to advertise four new albums in the USA. All four albums are by artists that do not have any tracks in the store right now:

| Artist Name | Genre |
| - | - |
| Regal | Hip-Hop |
| Red Tone | Punk |
| Meteor and the Girls | Pop |
| Slim Jim Bites | Blues |

We are interested in finding out which genres sell the best in the USA, in order to recommend the first three albums that should be selected for the store. 

We will write a SQL query to return the **number of tracks sold in the USA for each genre**, in terms of both absolute numbers and percentages.

In [3]:
%%sql
WITH usa_tracks_sold AS 
    (
     SELECT *
     FROM invoice_line il
     INNER JOIN invoice i ON il.invoice_id = i.invoice_id
     WHERE i.billing_country = 'USA'
    )
    
SELECT
    g.name Genre,
    COUNT(uts.invoice_line_id) Tracks_sold,
    ROUND(
        CAST(
            COUNT(uts.invoice_line_id) AS FLOAT) / (
            SELECT COUNT (*) FROM usa_tracks_sold
        ) * 100
        , 2) Percentage_sold
FROM usa_tracks_sold uts
INNER JOIN track t ON uts.track_id = t.track_id
INNER JOIN genre g ON t.genre_id = g.genre_id
GROUP BY Genre
ORDER BY Tracks_sold DESC
LIMIT 10;

 * sqlite:///chinook.db
Done.

[('Rock', 561, 53.38),
 ('Alternative & Punk', 130, 12.37),
 ('Metal', 124, 11.8),
 ('R&B/Soul', 53, 5.04),
 ('Blues', 36, 3.43),
 ('Alternative', 35, 3.33),
 ('Pop', 22, 2.09),
 ('Latin', 22, 2.09),
 ('Hip Hop/Rap', 20, 1.9),
 ('Jazz', 14, 1.33)]

Based on the findings above, we will **select the Punk, Pop and Blues albums** below:

| Artist Name | Genre | Recommendation
| - | - | - |
| Regal | Hip-Hop | Do not select album | 
| Red Tone | Punk | Select album |
| Meteor and the Girls | Pop | Select album |
| Slim Jim Bites | Blues | Select album |

The Regal album is unlikely to generate good sales as Hip Hop albums only contributes to 1.9% of all tracks sold in the USA. 

We can also suggest to collaborate with the record label on Rock albums too, since this genre is by far the most popular genre in the USA with over 50% of all tracks sold.

**b. Sales by Store Employee**

Each customer for the Chinook store gets assigned to a sales support agent when they first make a purchase. We can analyze the purchases of customers belonging to each employee to determine if any sales support agent is performing either better or worse than the others.

We will now compute the **total dollar amount of sales assigned to each sales support agent**.

In [4]:
%%sql
SELECT
    e.first_name || " " || e.last_name employee_name,
    e.birthdate employee_birth_date,
    e.hire_date employee_hire_date,
    ROUND(SUM(i.total)) total_sales
FROM employee e
INNER JOIN customer c ON e.employee_id = c.support_rep_id
INNER JOIN invoice i ON c.customer_id = i.customer_id
GROUP BY employee_name
ORDER BY total_sales DESC;

 * sqlite:///chinook.db
Done.

[('Jane Peacock', '1973-08-29 00:00:00', '2017-04-01 00:00:00', 1732.0),
 ('Margaret Park', '1947-09-19 00:00:00', '2017-05-03 00:00:00', 1584.0),
 ('Steve Johnson', '1965-03-03 00:00:00', '2017-10-17 00:00:00', 1394.0)]

The top employee (Jane Peacock) has about 25% more dollar sales than the last employee (Steve Johnson). This may be attributed to the difference in working duration at the store, since **employees with higher sales were hired at an earlier date**.

---

**c. Sales by Country**

We can analyze the **sales data for customers from each different country**, based on the `country` values from the `customers` table. 

Since there are a number of countries with only one customer, we will classify these customers under a new group named `Others`.

In [5]:
%%sql
WITH customers_others_sales AS
                               (
                                SELECT 
                                    c.customer_id,
                                    CASE
                                        WHEN (
                                            SELECT count(*) 
                                            FROM customer 
                                            where country = c.country
                                             ) = 1 THEN 'Others'
                                        ELSE c.country
                                    END AS country,
                                    i.total,
                                    i.invoice_id
                                FROM invoice i
                                INNER JOIN customer c on i.customer_id = c.customer_id
                               )
    
SELECT
    cos.*,
CASE
    WHEN cos.country = 'Others' THEN 1
    ELSE 0
END AS sort
FROM customers_others_sales cos
ORDER BY sort DESC
LIMIT 10;

 * sqlite:///chinook.db
Done.

[(49, 'Others', 10.89, 7, 1),
 (44, 'Others', 3.96, 15, 1),
 (9, 'Others', 8.91, 21, 1),
 (4, 'Others', 11.879999999999999, 24, 1),
 (55, 'Others', 1.98, 26, 1),
 (45, 'Others', 5.9399999999999995, 29, 1),
 (46, 'Others', 10.89, 30, 1),
 (51, 'Others', 6.93, 36, 1),
 (49, 'Others', 6.93, 38, 1),
 (50, 'Others', 7.92, 41, 1)]

Next, we will compute the following for each country:
- total number of customers
- total value of sales
- average value of sales per customer
- average value of each order placed

In [6]:
%%sql
WITH customers_others_sales AS
                               (
                                SELECT 
                                    c.customer_id,
                                    CASE
                                        WHEN (
                                            SELECT count(*) 
                                            FROM customer 
                                            where country = c.country
                                             ) = 1 THEN 'Others'
                                        ELSE c.country
                                    END AS country,
                                    i.total,
                                    i.invoice_id
                                FROM invoice i
                                INNER JOIN customer c on i.customer_id = c.customer_id
                               )

SELECT
    country,
    COUNT(DISTINCT customer_id) total_number_customers,
    ROUND(SUM(total), 2) total_value_sales,
    ROUND(SUM(total) / COUNT(DISTINCT customer_id), 2) avg_value_sales, 
    ROUND(SUM(total) / COUNT(DISTINCT invoice_id), 2) avg_value_order
FROM 
    (
        SELECT
            cos.*,
            CASE
                WHEN cos.country = 'Others' THEN 1
                ELSE 0
            END AS sort
        FROM customers_others_sales cos
    )
GROUP BY country
ORDER BY sort ASC, avg_value_sales DESC;

 * sqlite:///chinook.db
Done.

[('Czech Republic', 2, 273.24, 136.62, 9.11),
 ('Portugal', 2, 185.13, 92.57, 6.38),
 ('India', 2, 183.15, 91.58, 8.72),
 ('Brazil', 5, 427.68, 85.54, 7.01),
 ('Germany', 4, 334.62, 83.66, 8.16),
 ('United Kingdom', 3, 245.52, 81.84, 8.77),
 ('USA', 13, 1040.49, 80.04, 7.94),
 ('France', 5, 389.07, 77.81, 7.78),
 ('Canada', 8, 535.59, 66.95, 7.05),
 ('Others', 15, 1094.94, 73.0, 7.45)]

There may be potential for further expansion in the **Czech Republic, Portugal and India** markets as these countries have the **highest average sales per customer**. 

However, it should be noted that the **current trend is based on a small sample size** of 2 existing customers in each of these countries. Therefore, a slow expansion is recommended to ascertain whether the average sales remains high for new customers.

---

**d. Sales by Type of Purchase**

The Chinook store is setup in a way that allows customer to make purchases by purchasing a whole album or purchasing a collection of one or more individual tracks. When customers purchase albums they are charged the same price as if they had purchased each of those tracks separately.

The management is considering a change in purchasing strategy to cut costs, by purchasing only the most popular tracks from each album from record companies, instead of purchasing every track from an album. To understand the impact on overall revenue, we will find out what **percentage of purchases are individual tracks vs whole albums**.

For an album purchase, the list of `track_id` values in the invoice will be identical to the list of `track_id` values in the album. We will use this to categorize each invoice as an album purchase or not.

In [7]:
%%sql
SELECT
    il.invoice_id,
    CASE 
        WHEN (
                (
                    SELECT track_id
                    FROM invoice_line il1
                    WHERE il1.invoice_id = il.invoice_id
                    
                    EXCEPT
                    
                    SELECT track_id
                    FROM track t1
                    WHERE t1.album_id = t.album_id
                    
                ) IS NULL
                
                AND
            
                (
                    SELECT track_id
                    FROM track t1
                    WHERE t1.album_id = t.album_id
                    
                    EXCEPT
                    
                    SELECT track_id
                    FROM invoice_line il1
                    WHERE il1.invoice_id = il.invoice_id
                    
                ) IS NULL            
            
             ) THEN 'yes'
        ELSE 'no'
    END AS album_purchase
FROM invoice_line il
INNER JOIN track t ON il.track_id = t.track_id
GROUP BY il.invoice_id
LIMIT 10;

 * sqlite:///chinook.db
Done.

[(1, 'yes'),
 (2, 'no'),
 (3, 'no'),
 (4, 'no'),
 (5, 'yes'),
 (6, 'no'),
 (7, 'no'),
 (8, 'no'),
 (9, 'no'),
 (10, 'no')]

Now, we will determine the total number and percentage of invoices which are album purchases or not.

In [8]:
%%sql
SELECT
    CASE 
        WHEN (
                (
                    SELECT track_id
                    FROM invoice_line il1
                    WHERE il1.invoice_id = il.invoice_id
                    
                    EXCEPT
                    
                    SELECT track_id
                    FROM track t1
                    WHERE t1.album_id = t.album_id
                    
                ) IS NULL
                
                AND
            
                (
                    SELECT track_id
                    FROM track t1
                    WHERE t1.album_id = t.album_id
                    
                    EXCEPT
                    
                    SELECT track_id
                    FROM invoice_line il1
                    WHERE il1.invoice_id = il.invoice_id
                    
                ) IS NULL            
            
             ) THEN 'yes'
        ELSE 'no'
    END AS album_purchase,
    COUNT(DISTINCT il.invoice_id) number_of_invoices,
    ROUND(
        (
            CAST(COUNT(DISTINCT il.invoice_id) AS FLOAT) /
            (
                SELECT COUNT(*)
                FROM invoice
            )
        )
        * 100
        , 2) percentage_of_invoices
FROM invoice_line il
INNER JOIN track t ON il.track_id = t.track_id
GROUP BY album_purchase;

 * sqlite:///chinook.db
Done.

[('no', 500, 81.43), ('yes', 114, 18.57)]

The store should consider **retaining full album purchases** since they **contribute to almost 20% of total sales**.

---

## 4. Conclusion

a. Sales by Genre
- We will **select the Punk, Pop and Blues albums** as Hip Hop albums only contributes to 1.9% of all tracks sold in the USA.
- We also suggest to **collaborate with the record label on Rock albums**, since this genre is by far the most popular genre in the USA with over 50% of all tracks sold.

b. Sales by Store Employee
- The top employee (Jane Peacock) has about 25% more dollar sales than the last employee (Steve Johnson). 
- This may be attributed to the difference in working duration at the store, since **employees with higher sales were hired at an earlier date**.

c. Sales by Country
- There may be potential for further expansion in the **Czech Republic, Portugal and India** markets as these countries have the **highest average sales per customer**.
- However, it should be noted that the current trend is based on a **small sample size** of 2 existing customers in each of these countries. Therefore, a **slow expansion is recommended** to ascertain whether the average sales remains high for new customers.

d. Sales by Type of Purchase
- The store should consider **retaining full album purchases** since they **contribute to almost 20% of total sales**.